app/views/users/show.html.erb

<ul>
<% @user.shopping_lists.each do |sli| %>
---
SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."user_id" = ?  [["user_id", 1]]

<ul>
<% @user.fridges.each do |sli| %>
---
SELECT "fridges".* FROM "fridges" WHERE "fridges"."user_id" = ?  [["user_id", 1]]