app/views/past_recipes/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %><br>
    <%= f.select :user_id,
                 User.all.map { |p| [p.name, p.id] },
                 {include_blank: 'Choose...'},
                 selected: @user.try(:user).try(:id) %>