app/views/items/_form.html.erb

  <%= f.label :category_id %><br>
  <%= f.select :category_id,
                 Category.all.map { |p| [p.name, p.id] },
                 {include_blank: 'Choose...'},
                 selected: @category.try(:category).try(:id) %>
---
SELECT "categories".* FROM "categories"