app/views/shopping_lists/_form.html.erb

    <%= f.label :item_id %><br>
    <%= f.select :item_id,
                 Item.all.map { |p| [p.name, p.id] },
                 {include_blank: 'Choose...'},
                 selected: @item.try(:item).try(:id) %>
---
SELECT "items".* FROM "items"

    <%= f.label :user_id %><br>
    <%= f.select :user_id,
                 User.all.map { |p| [p.name, p.id] },
                 {include_blank: 'Choose...'},
                 selected: @user.try(:user).try(:id) %>
---
SELECT "users".* FROM "users"