app/views/shopping_lists/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Item:</strong>
  <%= Item.find(@shopping_list.item_id).name %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>User:</strong>
  <%= User.find(@shopping_list.user_id).name %>