app/controllers/fridges_controller.rb

SELECT "fridges".* FROM "fridges"
---
  def index
    @fridges = Fridge.all

INSERT INTO "fridges" ("created_at", "date_bought", "item_id", "quantity", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 02 Nov 2013 17:24:06 UTC +00:00], ["date_bought", Sat, 02 Nov 2013], ["item_id", 1], ["quantity", 1], ["updated_at", Sat, 02 Nov 2013 17:24:06 UTC +00:00], ["user_id", 1]]
---
  def create
    @fridge = Fridge.new(fridge_params)

    respond_to do |format|
      if @fridge.save

SELECT "fridges".* FROM "fridges" WHERE "fridges"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_fridge
      @fridge = Fridge.find(params[:id])