app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("category_id", "created_at", "exp_period", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", Sat, 02 Nov 2013 16:44:05 UTC +00:00], ["exp_period", 5], ["name", "Banana"], ["updated_at", Sat, 02 Nov 2013 16:44:05 UTC +00:00]]