app/controllers/past_recipes_controller.rb

  def index
    @past_recipes = PastRecipe.all
---
SELECT "past_recipes".* FROM "past_recipes"

  def create
    @past_recipe = PastRecipe.new(past_recipe_params)

    respond_to do |format|
      if @past_recipe.save
---
INSERT INTO "past_recipes" ("created_at", "date_made", "pearson_identity", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 02 Nov 2013 16:46:37 UTC +00:00], ["date_made", Fri, 01 Nov 2013], ["pearson_identity", "apple-fritters"], ["updated_at", Sat, 02 Nov 2013 16:46:37 UTC +00:00], ["user_id", 1]]

    def set_past_recipe
      @past_recipe = PastRecipe.find(params[:id])
---
SELECT "past_recipes".* FROM "past_recipes" WHERE "past_recipes"."id" = ? LIMIT 1  [["id", "1"]]