app/controllers/shopping_lists_controller.rb

SELECT "shopping_lists".* FROM "shopping_lists"
---
  def index
    @shopping_lists = ShoppingList.all

INSERT INTO "shopping_lists" ("created_at", "item_id", "quantity", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 02 Nov 2013 17:14:22 UTC +00:00], ["item_id", 1], ["quantity", 10], ["updated_at", Sat, 02 Nov 2013 17:14:22 UTC +00:00], ["user_id", 1]]
---
  def create
    @shopping_list = ShoppingList.new(shopping_list_params)

    respond_to do |format|
      if @shopping_list.save

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_shopping_list
      @shopping_list = ShoppingList.find(params[:id])