app/views/recipe/find.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "fridges".* FROM "fridges" WHERE "fridges"."user_id" = ?  [["user_id", 1]]
---
<%
  user = User.find(1)
  items_on_hand = []
  user.fridges.each do |f|